{"courseName":"Methodology of Science and Engineering","ects":"4","Module Manager":"Dr.M.P.M.Franssen    ,M.P.M.Franssen@tudelft.nl","Contact Hours / Week  x/x/x/x":"4/0/0/0","Education Period":"1","Start Education":"1","Exam Period":"1,2","Course Language":"English","Required for":"M.Sc. programme Computer EngineeringM.Sc. programme Media and Knowledge Engineering","Expected prior knowledge":"Standard propositional and predicate logic;Elementary probability theory","Summary":"This module introduces the student to:1. the aims and character of science and engineering as human practices;2. the distinction between facts and values or norms, and the role they play in science and engineering;3. ways of arguing in support of factual and in support of normative claims;4. aspects of empirical research: induction, deduction, measurement, evaluation;5. the character and status of theories and models in science and engineering;6. similarities and differences between the natural sciences and the human or social sciences.","Study Goals":"(1) To learn to distinguish the specific roles that empirical, formal and normative claims play in science and engineering;(2) To recognize and analyze the epistemic status of each type of claim and the ways in which claims in each of these categories can be supported and argued for;(3) To learn to appreciate the role of norms, values, and human decision-making in science and technology;(4) To come to understand the nature of empirical research, the role of different types of claims in it, and the constraints put to the justifiability of knowledge claims in science and engineering; (6) To learn to judge the similarities and distinctions between science and engineering (or belief and action), and between the natural and the social sciences;(7) To learn to recognize and explore the limits of formal and scientific descriptions of natural and social reality, and of the role of models, idealization, and abstraction in scientific and engineering knowledge.","Education Method":"The module is taught in the form of lectures with discussions mainly of exercises presented during the course. Students will be required to work on these exercises in-between classes.","Literature and Study Materials":"The study material for this course will be made available at the start of the course.","Assessment":"The student's grades for this course will be determined by the result of an individual exam taken at the end of the course. During the course students will be required to work at exercise questions; sufficient marks for the answers to these exercises will not be weighed into the final grade but will allow students to drop an exam question or work for bonus points.","Category":"BSc niveau","id":36665}