{"courseName":"Business Development Lab","ects":"10","Responsible Instructor":"Prof.dr.ir.F.W.Jansen    ,F.W.Jansen@tudelft.nl","Contact Hours / Week  x/x/x/x":"0/0/x/x","Education Period":"3,4","Start Education":"3","Exam Period":"none","Course Language":"English","Required for":"The Business Development Lab is part of the I&E minor of the EIT ICT Labs master school and is mandatory for the DMT and CCS students. It aims to provide the student with a basic understanding and ability to perform a business devel-opment process, focused on the development of a product and service and exploring its customer value, possible value chains, and its market potential (and not so much on the venturing process of starting a company). The applied methodology is based on the Business Model Generation method, emphasizing the nine building blocks of a business process model: customer segments, customer relations, channels, value proposition, key activities, key resources, key partners, cost structure and revenue streams.","Study Goals":"- In depth understanding of the different phases of a business development process- The ability to succesfully apply the learned knowledge for development of a new product or business concept- The ability to sytematically explore and create ideas or modify existing ideas and technology for business solutions- The ability to transforming new ideas into business solutions on the commercial market, combined with decision-making and leadership competencies- The ability to work in multi-disciplinary teams, and to reflect upon ethical and team processes","Education Method":"The BDL is done in projects groups and includes both a technical product design project and a business plan development. The project work is supported by coaches. During the course, several workshops and presentations are planned on the above topics. Towards the end of the course the students are trained to present their Business Plans. The course ends with a Business Plan pitch.The BDL will start with a winterschool, a 3-day workshop round a business case at the CLC (co-location) in Eindhoven. Applied lectures and workshops: 56 h (4h week)Group work: 168h (12h/week)Winterschool: 24hPresentation (report/pitch): 32h","Literature and Study Materials":"A. Osterwalder & Y. Piguer, Business Model Generation, John Wiley & Sons.","Assessment":"Peer evaluation of BP Presentation (25%) and expert evaluation BP Presentation (25%) - Evaluation BP by coaches (50%)","id":36717}