{"courseName":"Error Correcting Codes","ects":"4","Responsible Instructor":"Dr.ir.J.H.Weber    ,J.H.Weber@tudelft.nl","Contact Hours / Week  x/x/x/x":"0/0/0/3","Education Period":"4","Start Education":"4","Exam Period":"4","Course Language":"English","Expected prior knowledge":"A B.Sc. Programme in Electrical Engineering, Computer Science, or Mathematics","Study Goals":"The global goal of this course is to get acquinted with the basics and applications of error correction coding techniques. Such techniques are applied in order to protect information against errors which may occur during transmission or storage. The specific techniques under consideration in the course are the ones discussed in the lecture notes, which may be updated from year to year according to recent developments. The emphasis will be on the basic trade-offs between efficiency, reliability, and complexity. Unless explicitly indicated, the proofs of the results are not part of the course contents (the interested student may consult books from the bibliography). In the end, the student should be capable of making choices for suitable error correction coding techniques in the context of information transmission and storage applications. The student has to demonstrate to have understood the aforementioned techniques and trade-offs. This can be done in various ways.* \"Broad\": The student solves exercises in a closed-book written or oral exam. The level of these exercises is similar to the examples and exercises provided in the lecture notes. * \"Narrow, but in-depth\": In consultation with the lecturer, the student chooses a certain topic from the course, which is investigated in more detail, by writing either an essay (discussing a paper from the recent literature) or a computer program for a demo explaining the chosen topic (to be used by the lecturer in class room).","Education Method":"Lectures","Literature and Study Materials":"Lecture notes \"Error-Correcting Codes\" by J.H. Weber","Assessment":"Written (closed book), oral (closed book), essay, or computer program","Remarks":"Actual course information available on Blackboard.","id":37660}