{"courseName":"Designing Multi-actor Systems","ects":"6","Module Manager":"Dr.S.G.Lukosch    ,S.G.Lukosch@tudelft.nl","Instructor":"S.Cunningham    ,S.Cunningham@tudelft.nl , Dr.ir.J.H.Kwakkel    ,J.H.Kwakkel@tudelft.nl , H.K.Lukosch    ,H.K.Lukosch@tudelft.nl , Prof.dr.ir.A.Verbraeck    ,A.Verbraeck@tudelft.nl , Dr.H.G.van derVoort    ,H.G.vanderVoort@tudelft.nl","Contact Hours / Week  x/x/x/x":"X/0/0/0","Education Period":"1","Start Education":"1","Exam Period":"1,2","Course Language":"English","Required for":"SPM4140 - Service Systems Engineering","Summary":"In this course, students learn about designing complex, technological, large scale systems in multi-actor environments (in short, multi-actor systems). Different perspectives on systems design are discussed to provide students with a background for working with designers from different disciplines. Various aspects and principles of designing multi-actor systems are discussed from an engineering and a process perspective.Methods and tools for analysis and design of systems are introduced to teach students specific skills for the design of multi-actor systems. Thereby, the course provides students with a background for working with designers from different disciplines and they becomes familiar with the specific SEPAM-perspective on designing multi-actor systems.","Study Goals":"On completion of this course students are familiar with the specific SEPAM perspective on designing large scale, technology enabled multi-actor systems (MAS) in multi-actor environments. In particular: - Students are able to use and discuss concepts and terminology related to the design of MAS.- Students are able to use and discuss methods and tools that facilitate systems design and engineering.- Students are able to discuss the differences between design perspectives used in technical and social disciplines.- Students are able to describe and discuss process design guidelines for designing a decision making process in a multi-actor environment.- Students are able determine the appropriate use of methods for addressing socio-technical design challenges. - Students can design and specify systems engineering solutions through the use of requirements analysis and conceptual designs. - Students are able to apply methods and tools to enhance creativity in design processes.","Education Method":"The class sessions include lectures covering basic concepts. The course emphasis is mainly put on participation of the students in creativity discussions, problem solving, and concept design. Throughout the course student groups work on a project-based assignment. The project has the goal to create a design of a multi-actor system.","Literature and Study Materials":"- Sage, A.P. and Armstrong (Jr.), J.E. (2000). Introduction to Systems Engineering. John Wiley & Sons, Inc.- de Bruijn, H., ten Heuvelhof, E., and in 't Veld, R. J. (2010). Process Management. Springer Netherlands.- Reading materials: the concepts and topics discussed in the course will be reinforced by regular reading of papers, articles and book chapters as appropriate. These reading materials will be available on Blackboard.","Assessment":"At the end of the period, the course is assessed with an open book exam. The grade for the course is to 70% your grade for the exam and for 30% the grade for the final report that has to be prepared for the project-based assignment. Both, exam and case study, need to be passed.","Category":"MSc level","id":35214}