{"courseName":"IA Design Project","ects":"6","Module Manager":"Dr.M.V.Dignum    ,M.V.Dignum@tudelft.nl","Instructor":"Dr.H.M.Aldewereld    ,H.M.Aldewereld@tudelft.nl","Contact Hours / Week  x/x/x/x":"0/0/0/x","Education Period":"4","Start Education":"4","Exam Period":"none","Course Language":"English","Expected prior knowledge":"The courses in the first year of the MSc program SEPAM/IA","Summary":"This course involves a design assignment in which students will apply the theory on information system engineering methods, tools and principles taught in the prior courses in a realistic case related to their domain. Students will design a (complex multi-actor) system related to Information Architecture applying specific SEPAM and/or CS perspectives on designing. Most projects will integrate technical, system and actor related aspects. This includes addressing technology aspects, system engineering, decision-making support, and process and institutional aspects of the design and implementation process. Students are free to come up with suggestions for their own case study. The final delivery of this course concerns a scientific report which should more or less have the same structure as an individual MSc thesis. In this sense, this design course is an excellent preparation (within a group assignment) for the writing of an individual MSc thesis.","Study Goals":"On completion of this course, students will be able:- to choose suitable system design methods and tools, taking into account the substantive and process characteristics of the system and the multi-actor environment in a specific and realistic case in their domain;- to apply the chosen design methods and tools for this case;- to design a system taking into account technical domain, system engineering, decision-making, change process management and institutional aspects that are relevant for a certain case;- to develop knowledge and experience on the setup up and implementation of project teams.","Education Method":"The design teams will consist of preferably 3 or 4 students from the same domain. We aim at a realistic project management requiring independence and self organization of the teams. Teams are responsible for, e.g.: Project organization and task allocation and responsibilities; Interaction with client and problem owner to achieve agreement on focus, acceptance procedures, deliverables etc.; Planning and time management; Presentation of intermediary and final results. Each team is supervised by a docent and is required to maintain an up to date project page including logbook for each member, meeting reports, and other relevant information.Project timeline:- The project starts at the beginning of the period with a kick-off meeting for each subject (to be announced on Blackboard). - By mid-term, the first part of the assignment (problem analysis, list of requirements, choice of design methods and project plan) is handed in and presented.- In the second half of the period the actual system design has to be made.- At the end of the period, the groups will present their designs to each other and to an expert jury. - At the end of the period the design(s), documentation and report are handed in.","Literature and Study Materials":"- A case description will be handed out at the kick-off meeting. - Additional material will be distributed via Blackboard.","Prerequisites":"Students must have passed spm4141 MAS Design: An integrated view","Assessment":"The final mark is based on the written report, the designs and the presentations. A jury including representatives of ICT and EWI will assess and grade the project results. A condition for passing the project is that each supervisor finds the work sufficient (>= 6.0).","id":35211}