{"courseName":"Web Science & Engineering","ects":"5","Responsible Instructor":"Prof.dr.ir.G.J.P.M.Houben    ,G.J.P.M.Houben@tudelft.nl","Contact Hours / Week  x/x/x/x":"2/2/0/0","Education Period":"1,2","Start Education":"1","Exam Period":"none","Course Language":"English","Study Goals":"The student learns the important principles and concepts of web-based information systems and their engineering processes, and understands the main research challenges in the area.The student has knowledge about the main methods, techniques and languages used in the area of web-based information systems, in particular concerning web data. The student has knowledge of the main principles and techniques for user modelling and adaptation, and of the role of Social Web data for user modelling.The student learns the major challenges and principles from the research in the field of Web Science, and the role of web data for Web Science.The student is able to write a paper contributing to Web Science based on a problem in the field of web-based information systems.","Education Method":"The education includes:- Lectures, before which and after which students study material by themselves, to get an understanding of the relevant material;- Small assignments and hands-on exercises, to apply the understanding of relevant material;- One large assignment, with a number of feedback moments, to learn how to write a web science paper and contribute to relevant research.Lectures will be not each week in the class period (1+2): in between lectures there is time reserved for studying before and after lectures, for small assignments and exercises, and for writing the large assignment paper. The writing of the large assignment paper happens throughout the class period (1+2) to enable frequent feedback.","Assessment":"Assessment happens on the basis of the small assignments (accompanying the lectures), for 40% of the grade, and the large assignment (writing the web science paper), for 60% of the grade. Both parts need to be completed by the indicated deadlines.","id":34989}