{"courseName":"EIT Summer School","ects":"4","Responsible Instructor":"Prof.dr.ir.F.W.Jansen    ,F.W.Jansen@tudelft.nl","Contact Hours / Week  x/x/x/x":"Selfstudy","Education Period":"None (Self Study)","Start Education":"1","Exam Period":"none","Course Language":"English","Required for":"EIT master programma","Expected prior knowledge":"First year I&E courses","Study Goals":"- Understanding the process of Business Model Generation, andknowing how to define and analyse the nine building blocks (customer segments, customer relations, channels, value proposition, key activities, key resources, key partners, cost structure and revenue streams). [BDL learning outcome]- The ability to perform a business development process in the context of a societal relevant thematic area (such as Health and Wellbeing)- Understanding how technology and innovation interact with all stakeholders (eco-system, competitors, alliances, networks, markets, etc.)- The ability to reflect upon ethical, societal, scientific and sustainability considerations when developing new products/technologies and business models.- The ability to direct a business development process and to communicate and convey business proposals to business people and other stakeholders","Education Method":"A strong emphasis is on project work, team building, (personal) networking, cultural exchange, and creat-ing global awareness of societal and business trends. During the two weeks, students are confronted (i.e. meet in person) with involved stakeholders and with the ethical, societal, scientific and sustainability relevance of their ideas. The course emphasizes multidisciplinary work with attention to cure (societal and personal needs), culture (motivation and acceptation), concept (usability and technical realisation), and commercialisation (marketing plan and business realisation). During the first week, students are introduced to the thematic area by presentations on societal problems, trends, new technologies, and possible business opportunities. Here, the emphasis is on discussion, opin-ion making, and experiencing through observational practices and field tests. Students work in groups on a business cases and develop ICT applications (products or services) for a particular thematic area. They perform market studies, define user segments, analyse competitors, and develop their concepts into testable (lo-fi) prototypes. They perform user studies (focus groups) and further detail the technical concepts. At the end of the week they pitch their plan for a business panel.In the second week, students work towards a business plan (Product Operational Plan) and analyse all is-sues of relevance; markets, feasibility, usability, business life-cycles, operations and maintenance. They make a design/choice for a business pattern and platform, and a suitable revenue model, and analyse relevant issues, such as IPR, venture financing, etc.","Assessment":"Pitching of the business plans before a business panel and evaluation of a project report.","id":36718}