{"courseName":"Data Visualization","ects":"6","Responsible Instructor":"Prof.dr.E.Eisemann    ,E.Eisemann@tudelft.nl , Dr.A.Vilanova Bartroli    ,A.Vilanova@tudelft.nl","Contact Hours / Week  x/x/x/x":"0/4/0/0 + lab","Education Period":"2","Start Education":"2","Exam Period":"2,3","Course Language":"English","Required for":"Master course MKE","Expected prior knowledge":"IN2905-A Computer Graphics (recommended, not required)","Study Goals":"In this course, techniques and cases of data visualization are discussed: models, algorithms, and data representations for conversion of data sets into visual images, and associated interactive techniques.There are several applications for the techniques, medical, engineering, finances, economics, game analytics.After the course, the student has knowledge and understanding of a wide range of general visualization techniques, their mathematical foundations, their algorithmic form, and relevant data representations, so that (s)he can choose, adapt, and develop suitable techniques for a given practical visualization problem. Also, the student can describe practical examples and cases of visualization in several application fields.","Education Method":"Lectures, practical assignments, self-study of academic literature, projects.","Literature and Study Materials":"Course slides, instructions for projects.All available in electronic form via Blackboard.","Assessment":"The final grade is a weighted average based on up to three assignments, an exam that might contain multiple choice questions, and a visualization project. The project and assignments will be developed in couples and is evaluated based on the developed result, its documentation and presentation.","Judgement":"The grade consists of 3 elements: assignments, an exam, and a project.Main assignments (up to 3) will be checked and will represent 20% of the mark. All assignments, which are handed in late will be evaluated with a zero and impact the part of the mark that corresponds to the assignment. Additionally, an exam will be held, which will represent 30% of the mark. The exam might contain multiple-choice questions .Finally, the largest contribution is a visualization project (50%), which will be developed in couples.The project is evaluated based on the developed result, its documentation and presentation.Final Mark = 0.2 Assignments + 0.3 Exam + 0.5 ProjectThe course is passed if the final grade is 6 or higher in average.The only part that will get a resit is the exam. No resit will be provided for the project or assignments","id":34990}