{"courseName":"Seminar Affective Computing","ects":"5","Responsible Instructor":"Dr.ir.D.J.Broekens    ,D.J.Broekens@tudelft.nl","Contact Hours / Week  x/x/x/x":"4/0/0/0 + project","Education Period":"1","Start Education":"1","Exam Period":"none","Course Language":"English","Expected prior knowledge":"Intermediate-level programming skills in one of the following languages: C(++)/Java/Flash script/Python/Processing (or related language).Completion of a course on human computer interaction or related topic.Knowledge of Artificial Intelligence.In doubt: contact lecturer!","Study Goals":"Position the field of affective computing in computer science and psychology, and identify its major goals and angles of study.Define and explain emotion and affect.Relate emotion and affect to psychological theories of emotion.Explain major affect recognition, affect simulation and affect expression techniques. Explain how they are used in technological artifacts.Identify and evaluate implications and assumptions of a theoretical framework for affective system development.Develop in collaboration with others an affective system, and together evaluate the resulting system using the theoretical affective framework(s).","Education Method":"Seminar/Project form:Seminar:2 hours of lectures per week.Self-study of papers.The papers will be made available at the start of the course.Project:Perform a piece of research (survey, research question, programming, testing) and write a paper about it. Students will work in teams of about 3-4 persons!The different teams will probably have research projects that relate to the projects of other teams. As such, active participation is a must! Others depend on you work.","Literature and Study Materials":"papers and course slides. The papers will be made available at the start of the course.Depending on the cost, this year a book will be used. If that is the case, students will be notified at least 1 month in advance through blackboard.","Books":"Material consists of papers and course slides. The papers will be made available at the start of the course.Depending on the cost, this year a book will be used. If that is the case, students will be notified at least 1 month in advance through blackboard.","Assessment":"Project work (50%): paper, presentation, review of the paper of another group.Theoretical lectures (50%): mini exams, each lecture starts with a min exam on the material discussed in the previous lecture.Project and theoretical work will be averaged. This is your only official final grade. No separate project / theoretical grades will be administrated in OSIRIS.No final exam.","Enrolment / Application":"Mandatory (!) and in advance through blackboard or email.","maximum aantal deelnemers":"16","id":36702}