{"courseName":"Information Retrieval","ects":"5","Responsible Instructor":"A.Bozzon    ,A.Bozzon@tudelft.nl","Contact Hours / Week  x/x/x/x":"0/0/4/0","Education Period":"3","Start Education":"3","Exam Period":"none","Course Language":"English","Study Goals":"Learning Objectives:= Describe the different information retrieval models, and to compare their weaknesses and strengths. [Learning Objective 1]= Compare the weaknesses and strengths of different indexing techniques, describing their most suited applications trough meaningful examples. [Learning Objective 2]= Compare the weaknesses and strengths of different querying techniques, describing their most suited applications trough meaningful examples. [Learning Objective 3]= Analyse the performance of an Information Retrieval system by applying the proper evaluation measures. [Learning Objective 4]= Design and develop (Web) Information Retrieval systems, possibly using advanced social and se- mantic search functionalities. Support and defend the relevance and correctness of his/her choices with regards to the adopted information retrieval model, indexing technique, and querying tech- nique. [Learning Objective 5]= Describe and compare several crowdsourcing techniques. [Learning Objective 6]= Illustrate Information Retrieval application scenario for crowdsourcing. [Learning Objective 7]= Design and develop crowdsourcing applications, and to evaluate the obtained results. [Learning Objective 8]= Illustrate suitable application scenario for advanced Information Retrieval topics such as Semantic Search, Information Seeking Paradigms and User Interfaces for Information Retrieval, Search Results Diversification, and Expert Finding. [Learning Objective 9]","Education Method":"Lectures, individual and group exercises","Literature and Study Materials":"Scientific papers, course slides and blackboard notes.","Books":"*Introduction to Information Retrieval*Author(s): Christopher D. Manning, Prabhakar Raghavan and Hinrich Schtze.Cambridge University Press. 2008. ISBN-13: 978-0000000000http://nlp.stanford.edu/IR-book/information-retrieval-book.html*Web Information Retrieval*. Author(s): Stefano Ceri, Alessandro Bozzon, Marco Brambilla, Piero Fraternali, Emanuele Della Valle, Silvia Quarteroni.Springer, 2013. ISBN-13: 978-3642393136http://www.springer.com/computer/database+management+\\%26+information+retrieval/book/978-3-642-39313","Assessment":"Individual and group assignments","id":35210}