{"courseName":"Web Data Management","ects":"5","Responsible Instructor":"Dr.ir.A.J.H.Hidders    ,A.J.H.Hidders@tudelft.nl","Contact Hours / Week  x/x/x/x":"0/0/0/4","Education Period":"4","Start Education":"4","Exam Period":"none","Course Language":"English","Expected prior knowledge":"Bachelor level courses in database management systems and operating systems. A prior course in distributed systems or middleware would be helpful but is not required. Working knowledge of Java or C++ will be important for the final assignment.","Study Goals":"At the end of this course the student can- describe, explain and use effectively XML technologies such as XML, DTDs, XPath, XSLT and web services- describe, explain and use XQuery for data management, including its various extensions for scripting and full-text search- describe use and explain distributed file systems such as Google File System (GFS or GoogleFS) and the Hadoop Distributed File System (HDFS)- use and explain the advantages and disadvantages of distributed NoSQL databases such as CouchDB- program MapReduce frameworks to perform efficiently workflows for data analytics","Education Method":"Lectures, practical exercises, and depending upon the number of students presentations by students.","Literature and Study Materials":"Course slides, hand outs and blackboard notes.","Books":"(mandatory, but will be made available for free on Blackboard)Serge Abiteboul, Ioana Manolescu, Philippe Rigaux, Marie-Christine Rousset, Pierre Senellart: Web Data Management. Cambridge University Press, 30 nov. 2011, 406 pages.(advised, not mandatory reading)Abiteboul, S., Peter Buneman, and Dan Suciu. Data on the Web: From Relations to Semistructured Data and XML. San Francisco: Morgan Kaufmann, 1999.Katz, Howard, and D. D. Chamberlin. XQuery from the Experts: A Guide to the W3C XML Query Language. Boston: Addison-Wesley, 2003.Melton, Jim, and Stephen Buxton. Querying XML: XQuery, XPath, and SQL/XML in Context. The Morgan Kaufmann series in data management systems. Amsterdam: Elsevier/Morgan Kaufmann, 2006.","Assessment":"Presentation (if applicable) and final assignment.","id":36668}