{"courseName":"Economics of Cyber Security","ects":"5","Module Manager":"Dr.ir.C.H.G.Hernandez Ganan    ,C.H.G.HernandezGanan@tudelft.nl","Contact Hours / Week  x/x/x/x":"x/0/0/0","Education Period":"1","Start Education":"1","Exam Period":"1,2","Course Language":"English","Study Goals":"The student will:Gain a sound understanding of the economics of cybersecurity as a systems discipline, from security policies (modelling what ought to be protected) to mechanisms (how to implement the protection goals). Obtain skills in collecting and analysing data on information security issuesGain insights into the design of effective policies to enhance and maintain cyber security must take into account a complex set of incentives facing not only the providers and users of the internet and computer software, but also those of potential attackersLearn to apply economic analysis and data analytics to the open issues and pending activities in cybersecurity.","Education Method":"Blackboard TU Delft will be used for communications and distributing study material.The course will consists of 5 weeks of intensive theory (2 hours twice per week) after which students will perform their own EconSec study.During the period in which students are working on their study there will be one half-day meeting in which students get the opportunity to discuss their experiences and possible bottle-necks with the group and instructors.One month before the report deadline, there will be a full day meeting in which students are expected to present their research and (preliminary) results to the group and instructors with the aim to generate valuable feedback for finishing their research and report. While performing their own research students will have access to a forum via which students can discuss possible bottlenecks and exchange tips. The instructors will closely monitor the discussions and join when appropriate.","Assessment":"The final grade is based on a short research proposal, a presentation and a final case study report. When a final report is graded lower than 6, students have one month to improve the report for re-submission. The maximum grade after re-submission is 6.","Enrolment / Application":"A maximum number of 20 students will participate in the course.","id":37738}